insert into app_user
(created_at, last_modified_at, password, username, id)
values
    ('2024-01-23T15:17:35.242610400', '2024-01-23T15:17:35.243574700',
     '$2a$10$FztQozehoZx4SySGf/ZequuMZhCmNqVVJZRUgRolQwCjUNtkLNwfe', 'test1111', default), -- id 1번, username: test1111, password: test111!
    ('2024-01-24T15:17:35.242610400', '2024-01-24T15:17:35.243574700',
     '$2a$10$/FcMF/KKrK6.rjfvVn7oROfsFbvj96.JOWGt5O.wvxpxQUJJBl3tm', 'test2222', default); -- id 2번, username: test2222, password: test222@
insert into board
( content, count_heart, created_at, title, tag, category, deleted_at, last_modified_at, user_id, id)
values
    ('내용1', 0, '2024-01-15T15:35:22.371317', '제목1', '태그', 'NOTICE', null, '2024-01-25T15:35:22.371317', 1, default),
    ('내용2', 0, '2024-01-16T15:35:22.371317', '제목2', '태그', 'NOTICE', null, '2024-01-25T15:35:22.371317', 1, default),
    ('내용3', 0, '2024-01-17T15:35:22.371317', '제목3', '태그', 'NOTICE', null, '2024-01-25T15:35:22.371317', 1, default),
    ('내용4', 0, '2024-01-18T15:35:22.371317', '제목4', '태그', 'COMMON', null, '2024-01-25T15:35:22.371317', 1, default),
    ('내용5', 0, '2024-01-19T15:35:22.371317', '제목5', '태그', 'INFORMATION', null, '2024-01-25T15:35:22.371317', 1, default),
    ('내용6', 0, '2024-01-20T15:35:22.371317', '제목6', 'test', 'COMMON', null, '2024-01-25T15:35:22.371317', 1, default),
    ('내용7', 0, '2024-01-21T15:35:22.371317', '제목7', 'test', 'INFORMATION', null, '2024-01-25T15:35:22.371317', 2, default),
    ('내용8', 0, '2024-01-22T15:35:22.371317', '제목8', 'test', 'COMMON', null, '2024-01-25T15:35:22.371317', 2, default),
    ('내용9', 0, '2024-01-23T15:35:22.371317', '제목9', 'test', 'COMMON', null, '2024-01-25T15:35:22.371317', 2, default),
    ('내용10', 0, '2024-01-24T15:35:22.371317', '제목10', 'test', 'COMMON', null, '2024-01-25T15:35:22.371317', 2, default),
    ('내용11', 0, '2024-01-25T15:35:22.371317', '제목11', 'test', 'COMMON', null, '2024-01-25T15:35:22.371317', 2, default);
insert into comment
(content, created_at, deleted_at, last_modified_at, board_id, user_id, id)
values
    ('첫번째 글 댓글 내용1', '2024-01-25T15:20:28.274541', null, '2024-01-25T15:46:28.274541', 1, 1, default),
    ('첫번째 글 댓글 내용2', '2024-01-25T15:21:28.274541', null, '2024-01-25T15:46:28.274541', 1, 2, default),
    ('첫번째 글 댓글 내용3', '2024-01-25T15:22:28.274541', null, '2024-01-25T15:46:28.274541', 1, 1, default),
    ('첫번째 글 댓글 내용4', '2024-01-25T15:23:28.274541', null, '2024-01-25T15:46:28.274541', 1, 2, default),
    ('첫번째 글 댓글 내용5', '2024-01-25T15:24:28.274541', null, '2024-01-25T15:46:28.274541', 1, 1, default),
    ('첫번째 글 댓글 내용6', '2024-01-25T15:25:28.274541', null, '2024-01-25T15:46:28.274541', 1, 1, default),
    ('첫번째 글 댓글 내용7', '2024-01-25T15:26:28.274541', null, '2024-01-25T15:46:28.274541', 1, 2, default),
    ('첫번째 글 댓글 내용8', '2024-01-25T15:27:28.274541', null, '2024-01-25T15:46:28.274541', 1, 1, default),
    ('첫번째 글 댓글 내용9', '2024-01-25T15:28:28.274541', null, '2024-01-25T15:46:28.274541', 1, 2, default),
    ('첫번째 글 댓글 내용10', '2024-01-25T15:29:28.274541', null, '2024-01-25T15:46:28.274541', 1, 1, default),
    ('첫번째 글 댓글 내용11', '2024-01-25T15:30:28.274541', null, '2024-01-25T15:46:28.274541', 1, 1, default),
    ('두번째 글 댓글 내용1', '2024-01-25T15:40:28.274541', null, '2024-01-25T15:46:28.274541', 2, 1, default),
    ('두번째 글 댓글 내용2', '2024-01-25T15:41:28.274541', null, '2024-01-25T15:46:28.274541', 2, 1, default),
    ('두번째 글 댓글 내용3', '2024-01-25T15:42:28.274541', null, '2024-01-25T15:46:28.274541', 2, 2, default),
    ('두번째 글 댓글 내용4', '2024-01-25T15:43:28.274541', null, '2024-01-25T15:46:28.274541', 2, 2, default),
    ('두번째 글 댓글 내용5', '2024-01-25T15:44:28.274541', null, '2024-01-25T15:46:28.274541', 2, 1, default);